print("\n*************************************ex1*************************************")

# while 1: #1도 true라는 의미, 0이 아니면 다 True다
#     print(1)

# while True:
#     print(1)

print("\n*************************************ex2*************************************")
for i in range(10):
    print("i!!", i)


print("\n*************************************ex3*************************************")
for i in range(10):
    if i==2: #이게 맞으면 아래로 내려가지말고 다시 위로 돌아가라
        continue
    print("i!!", i)

print("\n*************************************ex4*************************************")
for i in range(10):
    if i == 2:
        continue
    elif i==7: #7일 때는 멈춘다
        break
    print("i!!", i)


